---
kind: property
id: P:Autodesk.Revit.DB.RenderNode.NodeName
source: html/f00a73db-fecc-70eb-c81a-67ef27212de5.htm
---
# Autodesk.Revit.DB.RenderNode.NodeName Property

A readable name of the output node.

## Syntax (C#)
```csharp
public string NodeName { get; }
```